app/controllers/categories_controller.rb

SELECT * FROM "categories" LIMIT 1
---
  def index
    @categories = Category.all

SELECT * FROM "categories"
---
  def new
    @category = Category.new
    @categories = Category.all

SELECT * FROM "categories" WHERE ("categories"."id" = 1)
SELECT * FROM "categories"
---
  def edit
    @category = Category.find(params[:id])
    @categories = Category.all - [@category]

SELECT * FROM "categories" LIMIT 1
INSERT INTO "categories" ("name", "created_at", "updated_at", "ancestry", "description") VALUES(E'Cheltuieli de baza', '2010-03-01 21:22:44.633169', '2010-03-01 21:22:44.633169', NULL, E'Cheltuieli necesare pentru traiul zilnic') RETURNING "id"
---
  def create
    params[:category].delete(:ancestry) if params[:category][:ancestry] == ''
    @category = Category.new(params[:category])
    @categories = Category.all

    respond_to do |format|
      if @category.save

SELECT * FROM "categories" WHERE (ancestry like E'24/25/%' or ancestry = E'24/25')
SELECT * FROM "categories" LIMIT 1
UPDATE "categories" SET "updated_at" = '2010-03-02 22:37:41.014705', "description" = E'Toate cheltuielile pentru locuinta: chirie, cheltuieli comune, electricitate, etc' WHERE "id" = 11
---
  def update
    @category = Category.find(params[:id])
    @categories = Category.all
    @selected = @category.parent.nil? ? nil : @category.parent.id

    if params[:category][:ancestry] == ''
      params[:category].delete(:ancestry)
      @category.ancestry = nil
    end

    respond_to do |format|
      if @category.update_attributes(params[:category])

SELECT * FROM "categories" WHERE (ancestry like E'1/4/%' or ancestry = E'1/4')
DELETE FROM "categories" WHERE "id" = 4
---
  def destroy
    if is_admin?
      @category = Category.find(params[:id])
      @category.destroy