app/controllers/expenses_controller.rb

SELECT * FROM "expenses"
---
  def index
    convert_date if (params[:search] && params[:search]['date_lte(1i)'])
    @search = current_user.expenses.order_by_date.search(params[:search])

SELECT * FROM "expenses" WHERE ("expenses"."id" = 1)
---
  def show
    @expense = current_user.expenses.find(params[:id])

SELECT * FROM "expenses" WHERE ("expenses".user_id = 2) AND ("expenses".user_id = 2) ORDER BY date DESC
---
  def new
    @expense = current_user.expenses.new
    remove_fixed_date if params[:remove_date]
    @expense.date = session[:date] unless session[:date].blank?

SELECT * FROM "expenses" WHERE ("expenses"."id" = 32 AND ("expenses".user_id = 2))
---
  def edit
    @expense = current_user.expenses.find(params[:id])

INSERT INTO "expenses" ("created_at", "updated_at", "amount", "date", "tags_saved", "category_id", "user_id", "category_saved") VALUES('2010-03-03 14:52:08.001701', '2010-03-03 14:52:08.001701', 123.0, '2010-03-03', E'alika', 19, NULL, NULL) RETURNING "id"
SELECT * FROM "expenses" WHERE ("expenses".user_id = 2) AND ("expenses".user_id = 2) ORDER BY date DESC
---
  def create
    params[:expense][:user_id] = current_user.id
    check_subcats
    @expense = Expense.new(params[:expense])

    respond_to do |format|
      if @expense.save
        # Attaching tags to the current user
        add_tags_to_current_user(@expense) unless params[:expense][:tag_list].blank?

SELECT * FROM "expenses" WHERE ("expenses"."id" = 32 AND ("expenses".user_id = 2))
UPDATE "expenses" SET "tags_saved" = E'uji, &*^', "updated_at" = '2010-03-02 22:26:46.653989' WHERE "id" = 21
---
  def update
    @expense = current_user.expenses.find(params[:id])
    get_divid_to_close

    respond_to do |format|
      if @expense.update_attributes(params[:expense])

SELECT * FROM "expenses" WHERE ("expenses"."id" = 32 AND ("expenses".user_id = 2))
DELETE FROM "expenses" WHERE "id" = 1
---
  def destroy
    @expense = current_user.expenses.find(params[:id])
    @expense.destroy